// Напишите программу, которая выводит массив из 8 элементов,
// заполненный нулями и единицами в случайное порядке.
// [1, 0, 1, 1, 0, 1, 0, 0]

int[] num = new int[8];
for (int i = 0; i < 8; i++)
{
    num[i] = new Random().Next(0, 2);
}
for (int i = 0; i < 8; i++)
{
    Console.Write(num[i] + " ");
}